import React from "react";
import "./littleAntPolicy.less";


export default class littleAntPolicy extends React.Component {
    constructor(props) {
        super(props)
    }
    render() {
        return (
            <div className="divContainer" style={{ height: document.body.clientHeight }}>
                <div className="divContent">
                <h5>小蚂蚁移动教学平台用户协议和隐私政策</h5>
    
   <p> 请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不进入小蚂蚁移动教学平台。当您注册成功，无论是进入app，还是在app上发布任何内容，或者是直接或通过各类方式间接使用网服务和数据的行为，都将被视作已无条件接受本声明所涉全部内容。
    若您对本声明的任何条款有异议，请停止使用小蚂蚁移动教学平台学平台所提供的全部服务。
    使用规则</p>
    <p>1、用户注册成功后，将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。</p>
    <p>2、用户须对在小蚂蚁移动教学平台的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；不得恶意使用注册帐号导致其他用户误认； 任何机构或个人注册和使用的互联网用户账号名称，不得有下列情形：<br/> （一）违反宪法或法律法规规定的；<br/> （二）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br/> （三）损害国家荣誉和利益的，损害公共利益的；<br/> （四）煽动民族仇恨、民族歧视，破坏民族团结的；<br/> （五）破坏国家宗教政策，宣扬邪教和封建迷信的；<br/> （六）散布谣言，扰乱社会秩序，破坏社会稳定的；<br/> （七）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br/> （八）侮辱或者诽谤他人，侵害他人合法权益的；<br/> （九）含有法律、行政法规禁止的其他内容的。
    关于用户名的管理
    请勿以党和国家领导人或其他名人的真实姓名、字、号、艺名、笔名、头衔等注册和使用昵 称（如确为本人，需要提交相关证据并通过审核方可允许使用）；
    请勿以国家组织机构或其他组织机构的名称等注册和使用昵称（如确为该机构，需要提交相关证据并通过审核方可允许使用）；
    请勿注册和使用与其他网友相同、相仿的名字或昵称；
    请勿注册和使用不文明、不健康的ID和昵称；
    请勿注册和使用易产生歧义、引起他人误解或带有各种奇形怪状符号的ID和昵称。
    用户以虚假信息骗取账号名称注册，或账号头像、简介等注册信息存在违法和不良信息的，小蚂蚁移动教学平台将暂停或注销。</p>
    <p>3、用户通过小蚂蚁移动教学平台发表的信息为半公开的信息，其他同平台用户均可以通过小蚂蚁移动教学平台获取用户发表的信息，用户对任何信息的发表即认可该信息为公开的信息，并单独对此行为承担法律责任；任何用户不愿被其他第三人获知的信息都不应该在小蚂蚁移动教学平台上进行发表。</p>
    <p>4、用户承诺不得以任何方式利用小蚂蚁移动教学平台直接或间接从事违反中国法律、以及社会公德的行为，小蚂蚁移动教学平台有权对违反上述承诺的内容予以删除。</p>
    <ul>5、小蚂蚁移动教学平台用户不得利用小蚂蚁移动教学平台服务制作、上载、复制、发布、传播或者转载如下内容：
        <li>·反对宪法所确定的基本原则的；</li>
     
    <li>· 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</li>
    <li>· 损害国家荣誉和利益的；</li>
    <li>· 煽动民族仇恨、民族歧视，破坏民族团结的；</li>
    <li>· 破坏国家宗教政策，宣扬邪教和封建迷信的；</li>
    <li>· 散布谣言，扰乱社会秩序，破坏社会稳定的；</li>
    <li>· 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</li>
    <li>· 侮辱或者诽谤他人，侵害他人合法权益的；</li>
   <li> · 含有法律、行政法规禁止的其他内容的信息。</li>
    </ul>
   <p> 6、小蚂蚁移动教学平台有权对用户使用小蚂蚁移动教学平台的情况进行审查和监督，如用户在使用小蚂蚁移动教学平台时违反任何上述规定，小蚂蚁移动教学平台或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容、暂停或终止用户使用小蚂蚁移动教学平台的权利）以减轻用户不当行为造成的影响。</p>
    
   <b>个人隐私</b>
   <p> 
    尊重用户个人隐私信息的私有性是小蚂蚁移动教学平台的一贯原则，小蚂蚁移动教学平台将通过技术手段、强化内部管理等办法充分保护用户的个人隐私信息，除法律或有法律赋予权限的政府部门要求或事先得到用户明确授权等原因外，小蚂蚁移动教学平台保证不对外公开或向第三方透露用户个人隐私信息，或用户在使用服务时存储的非公开内容。
    同时，为了运营和改善小蚂蚁移动教学平台的技术与服务，小蚂蚁移动教学平台将可能会自行收集使用或向第三方提供用户的非个人隐私信息，这将有助于小蚂蚁移动教学平台向用户提供更好的用户体验和服务质量。
    侵权举报</p>
    1、处理原则
 <p>   小蚂蚁移动教学平台高度重视自由表达和企业正当权利的平衡。依照法律规定删除违法信息是小蚂蚁移动教学平台社区的法定义务。</p>
    2、受理范围
   <p> 受理小蚂蚁移动教学平台内侵犯企业或个人合法权益的侵权举报，包括但不限于涉及个人隐私、造谣与诽谤、商业侵权。
    涉及个人隐私：发布内容中直接涉及身份信息，如个人姓名、家庭住址、身份证号码、工作单位、私人电话等详细个人隐私；
    造谣、诽谤：发布内容中指名道姓（包括自然人和企业）的直接谩骂、侮辱、虚构中伤、恶意诽谤等；
    商业侵权：泄露企业商业机密及其他根据保密协议不能公开讨论的内容。</p>
    3、举报条件
    <p>
如果个人或单位发现小蚂蚁移动教学平台上存在侵犯自身合法权益的内容，请与小蚂蚁移动教学平台取得联系（邮箱：wang398135290@gmail.com）。</p>
    4、处理流程
    <p>出于网络社区的监督属性，并非所有申请都必须受理。小蚂蚁移动教学平台自收到举报邮件七个工作日内处理完毕并给出回复。处理期间，不提供任何电话、邮件及其他方式的查询服务。
    出现小蚂蚁移动教学平台已经删除或处理的内容，但是百度、谷歌等搜索引擎依然可以搜索到的现象，是因为百度、谷歌等搜索引擎自带缓存，此类问题小蚂蚁移动教学平台无权也无法处理，因此相关申请不予受理。
    此为小蚂蚁移动教学平台唯一的官方的侵权投诉渠道，暂不提供其他方式处理此业务。用户在小蚂蚁移动教学平台中的商业行为引发的法律纠纷，由交易双方自行处理，与小蚂蚁移动教学平台无关。
    服务终止及暂停
    任何引起其他用户反感的行为，包括但不限于利用小蚂蚁移动教学平台平台发布广告或是垃圾信息，利用小蚂蚁移动教学平台骚扰其他用户等，网站可随时行使暂停、收回、删除帐号的权利。</p>
    <b>免责申明</b>
    <p>1、用户在小蚂蚁移动教学平台发表的内容仅表明其个人的立场和观点，并不代表小蚂蚁移动教学平台的立场或观点。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。小蚂蚁移动教学平台不承担任何法律及连带责任。<br />
    2、小蚂蚁移动教学平台不保证网络服务一定能满足用户的要求，也不保证网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作保证。<br />
    3、对于因不可抗力或小蚂蚁移动教学平台不能控制的原因造成的网络服务中断或其它缺陷，小蚂蚁移动教学平台不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
    <b>协议修改</b>
    <p>1、根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，小蚂蚁移动教学平台有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，小蚂蚁移动教学平台将会直接在小蚂蚁移动教学平台网站上公布修改之后的协议内容，该公布行为视为小蚂蚁移动教学平台已经通知用户修改内容。小蚂蚁移动教学平台也可采用电子邮件或私信的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。<br />
    2、如果不同意小蚂蚁移动教学平台对本协议相关条款所做的修改，用户有权并应当停止使用小蚂蚁移动教学平台。如果用户继续使用小蚂蚁移动教学平台，则视为用户接受小蚂蚁移动教学平台对本协议相关条款所做的修改。</p>
                    </div>
                </div>
                )
            }
    }                                                                                                                                        